In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series

# lambda

In [3]:
f= lambda x,y : x+y
print(f(1,4))

def f(x,y):
    return x+y
print(f(1,4))

5
5

In [4]:
f = lambda x : x**2
print(f(3))

f= lambda x: x+5
print(f(3))

(lambda x : x+1)(5)

9
8

6

# map & replace

In [5]:
ex = [1,2,3,4,5]
f = lambda x : x**2
print(list(map(f,ex)))

# lambda가 변수 2개니깐 
# map지정시, 함수하고 변수 두개 ex넣어줌
print()
f=lambda x, y : x+y
print(list(map(f,ex,ex)))

print()
print(list(map(lambda x:x+5, ex)))

[1, 4, 9, 16, 25]

[2, 4, 6, 8, 10]

[6, 7, 8, 9, 10]

In [6]:
s1= Series(np.arange(10))
print(s1)

print()
print(s1.head(5))

print()
print(s1.map(lambda x: x**2).head(5))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

0    0
1    1
2    2
3    3
4    4
dtype: int32

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [7]:
z = {1:'A',2:'B',3:'C'}
print(z)

#  s1 시리즈에 딕셔너리 z를 넣으면
# 시리즈 넘버가 일치하는 값에 딕셔너리 값을 넣어주고
# 딕셔너리 값이 없는 시리즈넘버에는 Nan값을 들어간다
print()
print(s1.map(z))

print()
s2 = Series(np.arange(10,20))
print(s2)

print()
print(s1.map(s2))

{1: 'A', 2: 'B', 3: 'C'}

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [8]:
 !wget https://raw.githubusercontent.com/rstudio/Intro/master/data/wages.csv

'wget'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [9]:
df = pd.read_csv("./data/wages.csv")
print(df.head())

print()
print(df.sex.unique())

print()
df["sex_code"] = df.sex.map({"male":0, "female":1})
df.head(5)

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

['male' 'female']

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [10]:
df.sex.replace({"male":0, "female":1}).head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [11]:
df.sex.head(5)

0      male
1    female
2    female
3    female
4    female
Name: sex, dtype: object

In [12]:
# inplace 는 데이터 변환 결과를 적용
df.sex.replace( ["male", "female"], [0,1], inplace=True)

In [13]:
del df["sex_code"]
df.head()

           earn  height  sex   race  ed  age
0  79571.299011   73.89    0  white  16   49
1  96396.988643   66.23    1  white  16   62
2  48710.666947   63.77    1  white  16   33
3  80478.096153   63.22    1  other  16   95
4  82089.345498   63.08    1  white  17   43

# apply & applymap

In [15]:
df = pd.read_csv("wages.csv")

df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [16]:
df_info = df[["earn", "height","age"]] 
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [17]:
f = lambda x : x.max() - x.min() 

df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [18]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [19]:
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [21]:
def f(x): 
    return Series([x.min(), x.max(), x.mean()], 
                        index=["min", "max", "mean"])

df_info.apply(f)

               earn    height        age
min      -98.580489  57.34000  22.000000
max   317949.127955  77.21000  95.000000
mean   32446.292622  66.59264  45.328499

In [22]:
f = lambda x : -x 
df_info.applymap(f).head(5)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [24]:
f = lambda x : -x 
df_info["earn"].apply(f).head(5)

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64